Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level2_source1.tmx
Source language: en_us
Languages: ja

source: Returns the given instance cast unconditionally to the specified type.
ja: 与えられたインスタンスを無条件に特定の型にキャストして返します。

source: Returns the given integer as the equivalent value in a different integer type.
ja: 与えられた整数を同等値としてある異なる整数型において返します。

source: Returns the given number unchanged.
ja: 与えられた数を変更せずに返します。

source: Returns the greater of the two given values.
ja: ２つの与えられた値の大きい方を返します。

source: Returns the greater of two comparable values.
ja: ２つの比較可能な値のうちより大きいものを返します。

source: Returns the greatest argument passed.
ja: 渡された引数の最も大きいものを返します。

source: Returns the index for the given key.
ja: 与えられたキーに対するインデックスを返します。

source: Returns the index of the last element in the collection that matches the given predicate.
ja: 与えられた述部に合致する、コレクションの中の最後の要素のインデックスを返します。

source: Returns the inverse of the bits set in the argument.
ja: 引数におけるビットの逆順を返します。

source: Returns the last element of the sequence that satisfies the given predicate.
ja: 与えられた述部を満たす、シーケンスの最後の要素を返します。

source: Returns the last index where the specified value appears in the collection.
ja: 指定された値がコレクションにおいて現れるところの最後のインデックスを返します。

source: Returns the least argument passed.
ja: 渡された引数の最も少ないものを返します。

source: Returns the lesser of the two given values.
ja: ２つの与えられた値のより小さい方を返します。

source: Returns the lesser of two comparable values.
ja: ２つの比較可能な値のうちより小さいものを返します。

source: Returns the longest possible subsequences of the collection, in order, around elements equal to the given element.
ja: 与えられた要素と等しい要素を避けるようにして、このコレクションの最も長くなりうる下位シーケンスを、順番に返します。

source: Returns the longest possible subsequences of the collection, in order, that don’t contain elements satisfying the given predicate.
ja: 与えられた述部を満たす要素を含んでいない、このコレクションの最も長くなりうる下位シーケンスそれらを順序どおりに返します。

source: Returns the longest possible subsequences of the sequence, in order, around elements equal to the given element.
ja: 与えられた要素と等しい要素を避けるようにして、このシーケンスの最も長くなりうる下位シーケンスを、順番に返します。

source: Returns the longest possible subsequences of the sequence, in order, that don’t contain elements satisfying the given predicate.
ja: 与えられた述部を満たす要素を含んでいない、このシーケンスの最も長くなりうる下位シーケンスそれらを順序どおりに返します。

source: Returns the maximum element in an asynchronous sequence of comparable elements.
ja: 比較可能要素それらからなるある非同期シーケンスの中の最大の要素を返します。

source: Returns the maximum element in the asynchronous sequence, using the given predicate as the comparison between elements.
ja: 非同期シーケンスの中の最大の要素を返します、与えられた述部を要素間の比較として使います。

source: Returns the maximum element in the sequence, using the given predicate as the comparison between elements.
ja: シーケンスの中の最大の要素を返します、与えられた述部を要素間の比較として使います。

source: Returns the maximum element in the sequence.
ja: シーケンスの中の最大の要素を返します。

source: Returns the minimum element in an asynchronous sequence of comparable elements.
ja: 比較可能要素それらからなるある非同期シーケンスの中の最小の要素を返します。

source: Returns the minimum element in the asynchronous sequence, using the given predicate as the comparison between elements.
ja: 非同期シーケンスの中の最小の要素を返します、与えられた述部を要素間の比較として使います。

source: Returns the minimum element in the sequence, using the given predicate as the comparison between elements.
ja: シーケンスの中の最小の要素を返します、与えられた述部を要素間の比較として使います。

source: Returns the minimum element in the sequence.
ja: シーケンスの中の最小の要素を返します。

source: Returns the position immediately after the given index.
ja: 与えられたインデックスの直後の位置を返します。

source: Returns the position immediately before the given index.
ja: 与えられたインデックスの直前の位置を返します。

source: Returns the product of the two given values, wrapping the result in case of any overflow.
ja: ２つの与えられた値の積を返します、何らかのオーバーフローの場合には結果をラップします。

source: Returns the product of this value and the given value, along with a Boolean value indicating whether overflow occurred in the operation.
ja: この値と与えられた値の積、それに加えてオーバーフローがその演算において起こったかどうかを示すブール値を返します。

source: Returns the quotient and remainder of this value divided by the given value.
ja: 与えられた値で除算されたこの値の商と余りを返します。

source: Returns the quotient obtained by dividing this value by the given value, along with a Boolean value indicating whether overflow occurred in the operation.
ja: この値を指定の値で割ることで入手される商、それに加えてオーバーフローがその演算において起こったかどうかを示すブール値を返します。

source: Returns the quotient of dividing the first value by the second, rounded to a representable value.
ja: 最初の値を２番目の値で除算した商を返します、表現可能な値に丸められます。

source: Returns the quotient of dividing the first value by the second.
ja: 最初の値を２番目の値で除算した商を返します。

source: Returns the range of indices described by this range expression within the given collection.
ja: 与えられたコレクション内の、この範囲式によって記述されるインデックスの範囲を返します。

source: Returns the remainder after dividing this value by the given value, along with a Boolean value indicating whether overflow occurred during division.
ja: この値を指定の値によって除算する後の余り、それに加えてオーバーフローが除算の間に起こったかどうかを示すブール値を返します。

source: Returns the remainder of dividing the first value by the second.
ja: 最初の値を２番目の値で除算した余りを返します。

source: Returns the remainder of this value divided by the given value using truncating division.
ja: 切り捨て除算を使って与えられた値で除算されたこの値の余りを返します。

source: Returns the remainder of this value divided by the given value.
ja: 与えられた値で除算されたこの値の余りを返します。

source: Returns the result of adding the product of the two given values to this value, computed without intermediate rounding.
ja: ２つの与えられた値の積をこの値に加える結果を返します、中間の丸めなしで計算されます。

source: Returns the result of combining the elements of the asynchronous sequence using the given closure, given a mutable initial value.
ja: 非同期シーケンスの要素をこの与えられたクロージャを使って結合する結果を返します、ある可変の初期値を与えられます。

source: Returns the result of combining the elements of the asynchronous sequence using the given closure.
ja: 非同期シーケンスの要素をこの与えられたクロージャを使って結合する結果を返します。

source: Returns the result of combining the elements of the sequence using the given closure.
ja: 与えられたクロージャを使って、このシーケンスの要素それらを結合する結果を返します。

source: Returns the result of performing a bitwise AND operation on the two given values.
ja: ビット単位AND演算を２つの与えられた値に関して実行する結果を返します。

source: Returns the result of performing a bitwise OR operation on the two given values.
ja: ビット単位OR演算を２つの与えられた値に関して実行する結果を返します。

source: Returns the result of performing a bitwise XOR operation on the two given values.
ja: ビット単位XOR演算を２つの与えられた値に関して実行する結果を返します。

source: Returns the result of shifting a value’s binary representation the specified number of digits to the left, masking the shift amount to the type’s bit width, and stores the result in the left-hand-side variable.
ja: ある値のバイナリ表現を指定された桁数だけ左にシフトする結果を返します、シフト量をその型のもつビット幅にマスクしています、そして結果を左手側の変数に格納します。

source: Returns the result of shifting a value’s binary representation the specified number of digits to the left, masking the shift amount to the type’s bit width.
ja: ある値のバイナリ表現を指定された桁数だけ左にシフトする結果を返します、シフト量をマスクしてその型のもつビット幅にしています。

source: Returns the result of shifting a value’s binary representation the specified number of digits to the left.
ja: ある値のバイナリ表現を指定された桁数だけ左にシフトする結果を返します。

source: Returns the result of shifting a value’s binary representation the specified number of digits to the right, masking the shift amount to the type’s bit width.
ja: ある値のバイナリ表現を指定された桁数だけ右にシフトする結果を返します、シフト量をその型のもつビット幅にマスクしています。

source: Returns the result of shifting a value’s binary representation the specified number of digits to the right.
ja: ある値のバイナリ表現を指定された桁数だけ右にシフトする結果を返します。

source: Returns the square root of the value, rounded to a representable value.
ja: この値の平方根を返します、表現可能な値に丸められます。

source: Returns the sum of the two given values, wrapping the result in case of any overflow.
ja: ２つの与えられた値の合計を返します、何らかのオーバーフローの場合には結果をラップします。

source: Returns the sum of this value and the given value, along with a Boolean value indicating whether overflow occurred in the operation.
ja: この値と与えられた値の合計、それに加えてオーバーフローがその演算において起こったかどうかを示すブール値を返します。

source: Returns the value with greater magnitude.
ja: より大きい規模を持つ値を返します。

source: Returns the value with lesser magnitude.
ja: より小さい規模を持つ値を返します。

source: Returns this value rounded to an integral value using the specified rounding rule.
ja: 指定された丸め規則を使って整数値に丸められたこの値を返します。

source: Returns this value rounded to an integral value using “schoolbook rounding.”
ja: 「教科書丸め」を使って整数値に丸めたこの値を返します。

source: Reverses the elements of the collection in place.
ja: コレクションの要素をその場で逆順にします。

source: Right shift operations on negative values “fill in” the high bits with ones instead of zeros.
ja: 負値上での右シフト演算は、高ビットを１で「満たします」、ゼロではなく。

source: Round to the closest allowed value that is greater than or equal to the source.
ja: ソースより大きいか等しい最も近い許される値に丸めます。

source: Round to the closest allowed value that is less than or equal to the source.
ja: ソースより小さいか等しい最も近い許される値に丸めます。

source: Round to the closest allowed value whose magnitude is greater than or equal to that of the source.
ja: それの規模がソースのそれより大きいか等しい最も近い許される値に丸めます。

source: Round to the closest allowed value whose magnitude is less than or equal to that of the source.
ja: それの規模がソースのそれより小さいか等しい最も近い許される値に丸めます。

source: Round to the closest allowed value; if two values are equally close, the even one is chosen.
ja: 最も近い許される値に丸めます；２つの値が同じくらい近いならば、偶数のものが選ばれます。

source: Round to the closest allowed value; if two values are equally close, the one with greater magnitude is chosen.
ja: 最も近い許される値に丸めます；２つの値が同じくらい近いならば、より大きい規模を持つものが選ばれます。

source: Rounding Values
ja: 値を丸める

source: Rounds the value to an integral value using the specified rounding rule.
ja: 指定された丸め規則を使ってこの値を整数値に丸めます。

source: Rounds this value to an integral value using “schoolbook rounding.”
ja: 「教科書丸め」を使ってこの値を整数値に丸めます。

source: SIMD Implementations
ja: SIMD実装

source: SIMD Vector Types
ja: SIMDベクター型

source: SIMD-Supporting Types
ja: SIMD支援型

source: Saved indices may become invalid as a result of mutating operations.
ja: 保存されたインデックスは変更を行う演算の結果として無効となるかもしれません。

source: Screenshot of the Xcode prompt to configure an Objective-C bridging header.
ja: Xcodeのスクリーンショットは、Objective-Cブリッジヘッダを構成設定するよう促します。

source: See Toll-Free Bridging for more information.
ja: さらなる情報のためにToll-Free Bridgingを見てください。

source: See StringInterpolationProtocol for details on appendInterpolation methods.
ja: StringInterpolationProtocolをappendInterpolationメソッドに関する詳細として見てください。

source: See String.UTF16View for more information
ja: String.UTF16Viewをさらなる情報のために見てください。

source: See String.UTF8View for more information
ja: String.UTF8Viewをさらなる情報のために見てください。

source: See also the ulp member property.
ja: またulpメンバープロパティも見てください。

source: See also the ulpOfOne static property.
ja: またulpOfOne静的プロパティを見てください。

source: Selecting Elements
ja: 要素の選択

source: Selecting and Excluding Elements
ja: 要素の選択と除外

source: Sequence and Collection Protocols
ja: シーケンスおよびコレクションプロトコル

source: SetAlgebra Implementations
ja: 集合代数実装

source: Sets and Dictionaries
ja: 集合と辞書

source: Setting the pointee autoreleases the new value before trivially storing it in the referenced memory.
ja: pointeeを設定することは、新しい値をオートリリースします、それをその参照されたメモリの中に自明に格納する前に。

source: Sharing class instances pervasively throughout an app makes logic errors more likely.
ja: アプリの隅々まで行き渡る共有クラスインスタンスは、論理エラーをより招きやすくします。

source: Sharing indices between collections and their subsequences is an important part of the design of Swift’s collection algorithms.
ja: コレクションとそれらの下位シーケンスとの間のインデックスの共有は、Swiftのコレクションアルゴリズム設計の重要な部分のひとつです。

source: Shuffles the collection in place, using the given generator as a source for randomness.
ja: コレクションをその場で混ぜ合わせます、与えられた生成子を無作為さの出典として使います。

source: Shuffles the collection in place.
ja: コレクションをその場で混ぜ合わせます。

source: Signaling NaNs typically raise the Invalid flag when used in general computing operations.
ja: シグナルNaNは、一般的な計算操作に使われる時に通常は無効フラグをあげます。

source: Signed Integers
ja: 符号付き整数

source: SignedInteger Implementations
ja: 符号付き整数実装

source: Similarly, if an error producing Objective-C method returns a nil value to indicate the failure of a method call, Swift changes the return type of the function to a nonoptional type.
ja: 同様に、エラーを生成しているObjective-Cメソッドがnil値を返してメソッド呼び出しの失敗を指し示すならば、スウィフトは関数の戻り型を非オプショナル型に変えます。

source: Simply surround a comma-separated list of values, instances, or literals with square brackets to create an array literal.
ja: 単にコンマ区切りの値、インスタンス、またはリテラルを角括弧で囲むことで、配列リテラルを作成してください。

source: Since equality between instances of Equatable types is an equivalence relation, any of your custom types that conform to Equatable must satisfy three conditions, for any values a, b, and c:
ja: Equatable型のインスタンス間の同等性は等値関係であることから、Equatableに準拠するあなたのあつらえの型は何であれ、任意の値a、b、そしてcに対して、３つの条件を満たす必要があります：

source: Since there is no key for 4, the closure returns nil in this case, which compactMap(_:) omits from the transformed asynchronous sequence.
ja: 4に対するキーがないことから、クロージャはnilをその場合には返します、それはcompactMap(_:)がこの変換されたシーケンスから省きます。

source: Single-value methods eliminate the need for a for await-in loop, and instead let you make a single await call.
ja: 単一値のメソッドそれらは、for await-inループの必要性を排除します、そして代わりにあなたにある単一のawait呼び出しをさせます。

source: Slices Are Views onto Arrays
ja: スライスは配列に関する見方です

source: Slices Inherit Collection Semantics
ja: スライスはコレクションの意味論を継承します

source: Slices Maintain Indices
ja: スライスはインデックスを維持します

source: Slices Share Indices
ja: スライスはインデックスを共有します

source: Slices maintain the same indices of the larger array for the same elements, so the starting index of a slice depends on how it was created, letting you perform index-based operations on either a full array or a slice.
ja: スライスはより大きな配列と同じインデックスを同じ要素に対して維持します、そのためスライスの開始インデックスはそれがどう作成されたかによって決まり、あなたにインデックスに基づく演算を完全な配列またはスライスのどちらでも実行させます。

source: Solve complex problems and write high-performance, readable code.
ja: 複雑な問題を解決します、そして高性能の、読みやすいコードを記述します。

source: Some examples:
ja: いくつかの例：

source: Some other types, such as optionals, arrays and ranges automatically become hashable when their type arguments implement the same.
ja: いくつかの他の型、オプショナル、配列および範囲は、自動的にハッシュ可能になります、それらの型引数が同じものを実装する場合には。

source: Some sequence and collection operations can be used more simply when the elements conform to Equatable.
ja: いくつかのシーケンスとコレクションの演算子は、要素がEquatableに準拠する時はより簡単に使われることができます。

source: Some special cases apply:
ja: いくつかの特別な場合が適用されます：

source: Sometimes you may want different error states to include the same common data, such as the position in a file or some of your application’s state.
ja: 時にはあなたは、いくらかの異なるエラー状態をこの同じ通常のデータに含めたいかもしれません、例えばあるファイル中の位置やあなたのアプリケーションの何らかの状態など。

source: Sorts the collection in place, using the given predicate as the comparison between elements.
ja: コレクションをその場でソートします、与えられた述部を要素間の比較として使います。

source: Sorts the collection in place.
ja: コレクションをその場でソートします。

source: Special-Use Collections
ja: 特殊用途のコレクション

source: Special-Use Numeric Types
ja: 特殊用途の数値型

source: Specifically, you use the Array type to hold elements of a single type, the array’s Element type.
ja: とりわけ、あなたはArray型をある単一の型、その配列のもつElement型、の複数の要素を保持するために使います。

source: Specifying the Associated Type
ja: 関連型を指定する

source: Specifying the Identified Item
ja: 同一視される項目を指定する

source: Splitting and Joining Elements
ja: 要素の分割と連結

source: Standard Library
ja: 標準ライブラリ

source: Standard input is interpreted as UTF-8.
ja: 標準入力は、UTF-8として解釈されます。

source: Starting with start, each successive value of the sequence adds stride until the next value would be beyond end.
ja: startで開始して、シーケンスのそれぞれ次の値はstrideを、次の値がendを越えることになるまで加えます。

source: Starting with start, each successive value of the sequence adds stride until the next value would be equal to or beyond end.
ja: startで開始して、シーケンスのそれぞれ次の値はstrideを、次の値がendに等しいか越えるまで加えます。

source: Starts a new scope in which a dynamic number of throwing tasks can be created.
ja: 新しいタスクグループを開始します、それにおいて動的な数のスローするタスクが作成されることが可能です。

source: Starts a new task group which provides a scope in which a dynamic number of tasks may be created.
ja: 新しいタスクグループを開始します、それはあるスコープを提供しそれにおいて動的な数のタスクが作成されるかもしれないものです。

source: Storage for a vector of 16 floating-point values.
ja: 16浮動小数点値のベクターに対するストレージ。

source: Storage for a vector of 16 integers.
ja: 16整数のベクターに対するストレージ。

source: Storage for a vector of 32 floating-point values.
ja: 32浮動小数点値のベクターに対するストレージ。

source: Storage for a vector of 32 integers.
ja: 32整数のベクターに対するストレージ。

source: Storage for a vector of 64 floating-point values.
ja: 64浮動小数点値のベクターに対するストレージ。

source: Storage for a vector of 64 integers.
ja: 64整数のベクターに対するストレージ。

source: Storage for a vector of eight floating-point values.
ja: ８浮動小数点値のベクターに対するストレージ。

source: Storage for a vector of eight integers.
ja: ８整数のベクターに対するストレージ。

source: Storage for a vector of four floating-point values.
ja: ４浮動小数点値のベクターに対するストレージ。

source: Storage for a vector of four integers.
ja: 4整数のベクターに対するストレージ。

source: Storage for a vector of two floating-point values.
ja: ２浮動小数点値のベクターに対するストレージ。

source: Storage for a vector of two integers.
ja: ２整数のベクターに対するストレージ。

source: Stores the result of performing a bitwise AND operation on the two given values in the left-hand-side variable.
ja: ビット単位AND演算を２つの与えられた値に関して実行する結果を左手側の変数に格納します。

source: Stores the result of performing a bitwise OR operation on the two given values in the left-hand-side variable.
ja: ビット単位OR演算を２つの与えられた値に関して実行する結果を左手側の変数に格納します。

source: Stores the result of performing a bitwise XOR operation on the two given values in the left-hand-side variable.
ja: ビット単位XOR演算を２つの与えられた値に関して実行する結果を左手側の変数に格納します。

source: Stores the result of shifting a value’s binary representation the specified number of digits to the left in the left-hand-side variable.
ja: ある値のバイナリ表現を指定された桁数だけ左にシフトする結果を左手側の変数に格納します。

source: Stores the result of shifting a value’s binary representation the specified number of digits to the right in the left-hand-side variable.
ja: ある値のバイナリ表現を指定された桁数だけ右にシフトする結果を左手側の変数に格納します。

source: Storing an unsafe task handle doesn’t have an impact on the task’s actual life cycle, and the behavior of accessing an unsafe task handle outside of the withUnsafeCurrentTask(body:) method’s closure isn’t defined.
ja: 非安全タスクハンドルを格納することは、タスクのもつ実際のライフサイクルに影響を与えません、そして非安全タスクハンドルにwithUnsafeCurrentTask(body:)メソッドのもつクロージャの外側でアクセスすることの挙動は未定義です。

source: Strideable Implementations
ja: Strideable実装

source: Strides
ja: ストライド

source: String Literals
ja: 文字列リテラル

source: String Representation
ja: 文字列表現

source: StringProtocol Implementations
ja: Stringプロトコル実装

source: Strings and Characters
ja: 文字列と文字

source: Strings and Text
ja: 文字列とテキスト

source: Strings are collections of Character instances, so the number of visible characters is generally the most natural way to count the length of a string.
ja: 文字列は、Characterインスタンスのコレクションです、なので見ることのできる文字の数はたいてい文字列の長さを数える最も自然な方法です。

source: Strings in Swift conform to the Comparable protocol, so the names are sorted in ascending order according to the less-than operator (<).
ja: 文字列はSwift ではComparableプロトコルに準拠します、それでこれらの名前はより小さい演算子（<）によって昇順にソートされます。

source: Structures
ja: 構造体

source: Structures and classes are good choices for storing data and modeling behavior in your apps, but their similarities can make it difficult to choose one over the other.
ja: 構造体とクラスは、あなたのアプリにおけるデータ格納と挙動モデル化のための良い選択です、しかしそれらの類似点は他方より一方を選ぶのを難しくするかもしれません。

source: Structures and classes both support a form of inheritance.
ja: 構造体とクラスは両方とも継承の形式をサポートします。

source: Structures and protocols can only adopt protocols; they can't inherit from classes.
ja: 構造体とプロトコルは、プロトコルの採用だけが可能です；それらはクラスから継承できません。

source: Structures in Swift include many features that are limited to classes in other languages: They can include stored properties, computed properties, and methods.
ja: Swiftでのさまざまな構造体は、他の言語ではクラスに限られる多くの機能を含みます：それらは格納プロパティ、計算プロパティ、そしてメソッドを含むことができます。

source: Structures with Default Values
ja: 省略時の値を持つ構造体

source: Subnormal numbers are often called denormal or denormalized—these are different names for the same concept.
ja: サブノーマル数は、しばしばデノーマルまたはデノーマライズされたと呼ばれます—それらは同じ概念に対する異なる名前です。

source: Subnormal values don’t use the full precision available to values of a type.
ja: サブノーマル値は、ある型の値に利用可能な完全な精度を使うことはできません。

source: Subscripting a dictionary with a key returns an optional value, because a dictionary might not hold a value for the key that you use in the subscript.
ja: あるキーで辞書に添え字を使うことは、オプショナル値を返します、なぜなら辞書はあなたが添え字に使ったキーに対して値を保持しないかもしれないからです。

source: Subscripting with a key takes the following form:
ja: キーによる添え字は以下の形式をとります：

source: Subscripting with a key, yielding an optional value:
ja: キーによる添え字、オプショナル値を生じます：

source: Subscripting with an index, yielding a key-value pair:
ja: インデックスによる添え字、キー値ペアを生じます：

source: Subscripts
ja: 添え字

source: Subtracts one value from another and produces their difference, rounded to a representable value.
ja: ある値をもう一方から減じて、それらの差を返します、表現可能な値へ丸められます。

source: Subtracts one value from another and produces their difference.
ja: ある値をもう一方から減じて、それらの差を返します。

source: Subtracts the second value from the first and stores the difference in the left-hand-side variable, rounding to a representable value.
ja: ２番目の値を最初のものから減じて、その差を左手側の変数の中に格納します、表現可能な値へ丸められます。

source: Subtracts the second value from the first and stores the difference in the left-hand-side variable, wrapping any overflow.
ja: ２番目の値を最初のものから減じてその差を左手側の変数の中に格納します、あらゆるオーバーフローをラップします。

source: Subtracts the second value from the first and stores the difference in the left-hand-side variable.
ja: ２番目の値を最初のものから減じて、その差を左手側の変数の中に格納します。

source: Such types are called global actor types, and can be applied to any declaration to specify that such types are isolated to that global actor type.
ja: そのような型はグローバルアクター型と呼ばれます、そしてあらゆる宣言に適用されることでそのような型それらがそのグローバルアクター型と分離されることを指定できます。

source: Supporting Functions
ja: 補助関数

source: Supporting Types
ja: 支援を行う型

source: Suppose you are tasked with finding the first two days with absences in the session.
ja: あなたがこの学期において欠席者のある最初の２つの日付を見つける任務を負うと考えてください。

source: Suppose you need to store a list of the names of students that are signed up for a class you’re teaching.
ja: あなたが生徒の名前のリストをしまっておく必要があると仮定してみましょう、それはあなたが教えているクラスに受講届けを出されるものです。

source: Suspends the current task, then calls the given closure with a checked continuation for the current task.
ja: 現在のタスクを中断します、それからこの与えられたクロージャを、現在のタスクに対する検査済み継続で呼び出します。

source: Suspends the current task, then calls the given closure with a checked throwing continuation for the current task.
ja: 現在のタスクを中断します、それからこの与えられたクロージャを、現在のタスクに対する検査済みスロー継続で呼び出します。

source: Suspends the current task, then calls the given closure with an unsafe continuation for the current task.
ja: 現在のタスクを中断します、それからこの与えられたクロージャを、現在のタスクに対する安全でない継続で呼び出します。

source: Suspends the current task, then calls the given closure with an unsafe throwing continuation for the current task.
ja: 現在のタスクを中断します、それからこの与えられたクロージャを、現在のタスクに対する安全でないスロー継続で呼び出します。

source: Swift 5.5 and later automatically translates Objective-C methods that take completion handlers into asynchronous methods using Swift's native concurrency support, in addition to importing the callback-based version of the method into Swift.
ja: Swift 5.5以降は、完了ハンドラをとるObjective-Cメソッドを非同期メソッドへとSwiftの生得の並行性サポートを使って自動的に翻訳します、そのメソッドのコールバック基盤バージョンをSwiftへとインポートするのに加えて。

source: Swift Standard Library
ja: Swift標準ライブラリ

source: Swift Standard Library Functions
ja: Swift標準ライブラリ関数

source: Swift Syntax
ja: スウィフト構文

source: Swift and Objective-C in the Same Project
ja: 同じプロジェクトの中のSwiftとObjective-C

source: Swift automatically imports simple, constant-like macros, declared with the #define directive, as global constants.
ja: Swiftは自動的に簡単に、#defineで宣言される、定数のようなマクロをグローバル定数としてインポートします。

source: Swift automatically translates Objective-C methods that produce errors into methods that throw an error according to Swift’s native error handling functionality.
ja: スウィフトは、自動的にエラーを生成するObjective-Cメソッドを、スウィフト固有のエラー処理機能に従ってエラーをスローするメソッドに翻訳します。

source: Swift deliberately avoids using the term “epsilon” because:
ja: Swiftは、故意に用語 “イプシロン” を使うのを避けます、なぜなら：

source: Swift ensures your code is fast and efficient, while its memory safety and native error handling make the language safe by design.
ja: Swiftは、あなたのコードが高速で効率的であるのを受け合う一方で、それのメモリ安全と生得のエラー処理は言語を計画的に安全にします。
